#자료형
#1. 리스트

a = [1,2,3,4,5]
b = [1,2,3, 'a', 'b']
print(b)

print(a[0] + a[3])   #1+4. 단 type이 같아야 한다. 

print(type(a))
print("=================================================================")

a = [1, 2, 3, ['a', 'b', 'c']]
print(a[1])
print(a[-1])
print(a[-1][1])  #????????
print("=================================================================")


#1-2. 리스트 슬라이싱
c = [1,2,3,4,5]
print(c[:2])  #   :은 -1이므로 1,2,만 출력. 
print("=================================================================")

#1-3. 리스트 더찾기
a = [1, 2, 3]
b = [4, 5, 6]
print(a + b)  #컴퓨터의 입장. 

c = [7,8,9,10]
print(c)

print(a * 3)
#print(a[2] + 'hi')는 타입이 다르므로 불가. 

print(str(a[2])+ '   hi') #형변환

f = '5'
print(a[2]+int(f))
print("=================================================================")

#리스트 관련 함수
c = [1,2,3]
c.append(4)
print(c)

# c = c.append(5) 는 안된다. 왜냐하면 붙힌것에 붙힌것은 불가. 
print("=================================================================")


a = [1, 3, 4, 2]
a.sort()   #정렬
print(a)

a.reverse()
print(a)

print(a.index(3))  # == a[3]
print(a.index(1))  # == a[1]

a.insert(0, 7)  #[7, 4, 3, 2, 1]  0번째 자리에 7을 넣는다.
print(a)
a.insert(3, 3) #[7, 4, 3, 3, 2, 1]
print(a)

print("=================================================================")

a.remove(7)  #a란 리스트에서 7인자를 지운다.  #[4, 3, 3, 2, 1]
print(a)
a.remove(3)  #3이 두개면, 먼저 나오는 것을 지운다. 
print(a)     #[4, 3, 2, 1]


print("=================================================================")











